generated/nova_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <ns1:erstellePreisAuskunft xmlns:ns1="http://nova.voev.ch/services/v14/preisauskunft">
      <ns1:PreisAuskunftRequest xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ns1:kundenSegmenteGruppieren="false" xsi:type="ns1:VerbindungPreisAuskunftRequest">
        <ns1:clientIdentifier xmlns:ns3="http://nova.voev.ch/services/v14/base" ns3:leistungsVermittler="11" ns3:kanalCode="41" ns3:verkaufsStelle="16437" ns3:vertriebsPunkt="16437" ns3:verkaufsGeraeteId="236"/>
        <ns1:correlationKontext>
          <ns3:correlationId xmlns:ns3="http://nova.voev.ch/services/v14/base">87482634-560b-4da3-b6a1-155c37490fed</ns3:correlationId>
          <ns3:geschaeftsProzessId xmlns:ns3="http://nova.voev.ch/services/v14/base">1781786f-57ba-4e9a-bc29-287e2aa97f9a</ns3:geschaeftsProzessId>
        </ns1:correlationKontext>
        <ns1:angebotsFilter xmlns:ns3="http://nova.voev.ch/services/v14/vertriebsbase" xsi:type="ns3:TaxonomieFilter">
          <ns3:produktTaxonomie>Basistaxonomie</ns3:produktTaxonomie>
          <ns3:taxonomieKlassePfad>
            <ns3:klassenName>Einzelbillette</ns3:klassenName>
          </ns3:taxonomieKlassePfad>
        </ns1:angebotsFilter>
        <ns1:reisender ns1:alter="25" ns1:externeReisendenReferenzId="1234" ns1:reisendenTyp="PERSON"/>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-CB773923-1FA3-4DB3-9BC7-8DEDB26D1A10_1_5">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8500218" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-21T12:04:00Z" ns3:ankunftsZeit="2023-04-21T12:30:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="91061"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8500218" ns3:ausstieg="8502119" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-21T12:37:00Z" ns3:ankunftsZeit="2023-04-21T12:57:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="S" ns3:verkehrsMittelNummer="91026"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502119" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8502119" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-21T13:01:00Z" ns3:ankunftsZeit="2023-04-21T13:22:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="RE" ns3:verkehrsMittelNummer="9101"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502119" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-965F1104-370B-4123-94AE-A59C5C2EF00E_1_1">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-21T12:31:00Z" ns3:ankunftsZeit="2023-04-21T13:28:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="91001"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-62712077-3C29-40D9-865B-020316391CD7_1_3">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8502113" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-21T12:33:00Z" ns3:ankunftsZeit="2023-04-21T13:11:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IR" ns3:verkehrsMittelNummer="91016"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502113" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8502113" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-21T13:23:00Z" ns3:ankunftsZeit="2023-04-21T13:52:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IR" ns3:verkehrsMittelNummer="91037"/>
            <ns3:zwischenHaltContext ns3:uicCode="8502113" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-12F40801-E365-4755-B205-A23329CDC378_1_1">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-21T12:33:00Z" ns3:ankunftsZeit="2023-04-21T13:54:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IR" ns3:verkehrsMittelNummer="91016"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-CA331643-7004-436C-95BC-E4D66DFD1CAD_1_3">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8500218" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-21T12:36:00Z" ns3:ankunftsZeit="2023-04-21T13:03:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="EC" ns3:verkehrsMittelNummer="9102"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8500218" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-21T13:20:00Z" ns3:ankunftsZeit="2023-04-21T13:56:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="91005"/>
            <ns3:zwischenHaltContext ns3:uicCode="8500218" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
        <ns1:verbindung ns1:externeVerbindungsReferenzId="ID-957EC465-6761-4C54-A911-A329AD122F25_1_1">
          <ns1:segmentHinFahrt xmlns:ns3="http://nova.voev.ch/services/v14/vertrieb" ns3:einstieg="8507000" ns3:ausstieg="8503000" ns3:verwaltungsCode="000011" ns3:abfahrtsZeit="2023-04-21T13:02:00Z" ns3:ankunftsZeit="2023-04-21T13:58:00Z">
            <ns3:verkehrsMittel ns3:gattungsCode="IC" ns3:verkehrsMittelNummer="91081"/>
            <ns3:zwischenHaltContext ns3:uicCode="8507000" ns3:tripContext="PLANNED"/>
            <ns3:zwischenHaltContext ns3:uicCode="8503000" ns3:tripContext="PLANNED"/>
          </ns1:segmentHinFahrt>
        </ns1:verbindung>
      </ns1:PreisAuskunftRequest>
    </ns1:erstellePreisAuskunft>
  </soapenv:Body>
</soapenv:Envelope>
